app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @user = User.new(params[:user])
#
#    file_param = params[:image]
#  file_name = file_param.original_filename
#
#  file_data = File.read(file_param.tempfile)
#
#  File.open File.join('photos', file_name), 'w' do |f|
#    f.write(file_data)


#    pic = params[:user][:image]
#    @user.image = pic.original_filename
#    FileUtils.copy(pic.local_path)
    ##    @user.image_full=params[:user][:image].read
    #    @user.image_full_mime=params[:user][:image].content_type()
    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`password`, `updated_at`, `created_at`, `name`, `image`, `email`, `gender`, `age`) VALUES ('urjitvarsha', '2012-01-06 07:46:50', '2012-01-06 07:46:50', 'urjit', x'75726a6974', 'urjit.rajgor@gmail.com', 1, 25)

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def sign_in

    @user = User.find_by_name_and_password(params[:login][:name],params[:login][:password])
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = 'urjit' AND `users`.`password` = 'urjitvarsha123' LIMIT 1