app/controllers/welcome_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def deshboard
    @user = User.find(params[:id])